In [16]:
from datetime import datetime

import configparser
import pandas as pd

In [17]:
config = configparser.ConfigParser()
config.read('config.ini')
last_paid = datetime.strptime(config['DEFAULT']['last_paid'], '%Y-%m-%d')
mint_analysis = datetime.strptime(config['DEFAULT']['mint_analysis'], '%Y-%m-%d')

In [18]:
chase = pd.read_csv('ChaseCC.csv')
citi = pd.read_csv('CitiCC.csv')
mint = pd.read_csv('Mint.csv')

In [19]:
chase['trans_date'] = pd.to_datetime(chase['Transaction Date'])
citi['trans_date'] = pd.to_datetime(citi['Date'])
mint['trans_date'] = pd.to_datetime(mint['Date'])

In [20]:
chase = chase[chase['trans_date'] > last_paid]
chase = chase[chase['Type'] != 'Payment']
citi = citi[citi['trans_date'] > last_paid]
citi = citi[~citi['Description'].str.contains('PAYMENT, THANK YOU')]
mint = mint[mint['trans_date'] > mint_analysis]

In [21]:
chase['amt'] = chase['Amount'] * -1

In [22]:
citi.loc[(citi['Debit'].notnull()), 'amt'] = citi['Debit']
citi.loc[(citi['Credit'].notnull()), 'amt'] = citi['Credit']

In [23]:
mint.loc[(mint['Transaction Type'] == 'debit'), 'amt'] = mint['Amount']
mint.loc[(mint['Transaction Type'] == 'credit'), 'amt'] = mint['Amount'] * -1

In [24]:
chase = chase[['trans_date', 'amt', 'Description']]
citi = citi[['trans_date', 'amt', 'Description']]
mint = mint[['trans_date', 'amt', 'Category', 'Description', 'Original Description']]

In [25]:
chase.head(5)

  trans_date     amt         Description
0 2020-12-21   47.69         UBER   EATS
1 2020-12-16   25.00  TVY*FITNESSYOURWAY
2 2020-12-14   32.66         UBER   EATS
3 2020-12-13   42.77         UBER   EATS
4 2020-12-10  114.54    SPRINT *WIRELESS

In [26]:
citi.head(5)

  trans_date     amt                                        Description
0 2020-12-24 -449.99  PAYPAL *B H PHOTO 4029357733 NY Digital Accoun...
1 2020-12-24    6.36                PAYPAL *AMAGICOM AB 35314369001 SWE
2 2020-12-22  115.62                 TRADER JOE'S #692 QPS BRENTWOOD MO
3 2020-12-21   10.69  PAYPAL *SPOTIFYUSAI 4029357733 NY Digital Acco...
4 2020-12-19  126.14               Amazon Prime*YG8V21593 8665572820 WA

In [27]:
mint.head(5)

,trans_date,amt,Category,Description,Original Description
0,2020-12-26,-1550.96,Credit Card Payment,PAYMENT THANK YOU,PAYMENT THANK YOU
1,2020-12-24,498.32,Shopping,MICRO CENTER BRNTWD-09 BRENTWOOD MO,MICRO CENTER BRNTWD-09 BRENTWOOD MO
2,2020-12-25,-8.86,Interest Income,Interest Paid,Interest Paid
3,2020-12-24,-449.99,Shopping,B H Photo,PAYPAL *B H PHOTO 4029357733 NY
4,2020-12-24,6.36,Shopping,AMAGICOM AB 35314369001 SWE,PAYPAL *AMAGICOM AB 35314369001 SWE

In [29]:
mint['amt'].sum()

17252.749999999996